Tekla.Structures.ModelInternal.ModelExporter
Provides functionality to export a model either locally or to the cloud.
Remarks: This class supports exporting models in various formats, including TrimBM and Semantic
TrimBIM,  and provides methods for both local file creation and cloud publishing. It handles scenarios such as
exporting only selected parts of the model, creating new versions of existing models, and managing  permissions
for cloud uploads.

Tekla.Structures.ModelInternal.ModelExporter.PublishAction
Represents the action name for publishing a model to the cloud.
Remarks: This constant is intended for use in scenarios where the action of publishing a model
to the cloud needs to be referenced, such as in user interface elements or logging.

Tekla.Structures.ModelInternal.ModelExporter.ExportFailure
Represents the error message displayed when a model export operation fails.

Tekla.Structures.ModelInternal.ModelExporter.ExportFailureLocal
Represents the error message displayed when a local file creation operation fails.

Tekla.Structures.ModelInternal.ModelExporter.ExportFailureFileTooLarge
Represents the error message displayed when the exported file exceeds the maximum allowed size for upload.

Tekla.Structures.ModelInternal.ModelExporter.ExportFailureNewVersion
Represents the error message displayed when the system fails to create a new version of the model or upload
a file.

Tekla.Structures.ModelInternal.ModelExporter.ExportFailureNewModel
Represents the error message displayed when the system fails to create a new model or upload a file.

Tekla.Structures.ModelInternal.ModelExporter.ExportPermissionsFailure
Represents the error message displayed when setting model permissions fails after model creation.

Tekla.Structures.ModelInternal.ModelExporter.ExceptionDuringPublish
Represents the error message used when an exception occurs during a publishing operation.

Tekla.Structures.ModelInternal.ModelExporter.OperationCancelled
Represents the message used to indicate that an operation was canceled by the user.

Tekla.Structures.ModelInternal.ModelExporter.OperationTimeout
Represents the message used when an operation times out.

Tekla.Structures.ModelInternal.ModelExporter.UnsupportedFormat
Represents the error message used when an unsupported export format is encountered.
Remarks: This constant is intended for internal use to provide a standardized error message
when an export operation encounters an unsupported format.

Tekla.Structures.ModelInternal.ModelExporter.#ctor(Microsoft.Extensions.Logging.ILogger,System.String)
Constructor for ModelExporter
logger: Logger of type ILogger to be passed.
tempFolder: Temporary folder for the propert set resource file.
Throws System.ArgumentNullException: Thrown when logger is null.
Throws System.ArgumentException: Thrown when tempFolder is null, empty or contains only whitespace.

Tekla.Structures.ModelInternal.ModelExporter.ExportModelLocally(System.String,System.String,System.String,System.IO.Stream,System.Boolean)
Creates local export (in TrimBM and Semantic TrimBIM formats) of the model
folderPath: Folder path for the file
modelName: The model name (together with revision create the fileName)
revision: The revision (together with the model name create the fileName)
exportConfiguration: Export configuration passed from AppFeatures
isSelectedOnly: If true, the export be done only of model selected parts
Returns: True if model has been exported successfully, false otherwise

Tekla.Structures.ModelInternal.ModelExporter.ExportModelCloud(Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductClient,Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion,System.String,System.String,System.String,System.String,System.String,System.IO.Stream,System.Boolean,Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo,System.Collections.Generic.IEnumerable{Tekla.Structures.ModelInternal.BimModelDataProduct.AccessControlListEntry},System.Collections.Generic.IReadOnlyDictionary{System.String,System.String},System.Collections.Generic.Dictionary{System.String,System.Object},System.Nullable{System.Threading.CancellationToken},System.IProgress{Tekla.Structures.Model.Internal.BimModelDataProduct.Types.UploadProgress})
Publishes the model to the Cloud
client: Cloud Client
region: Region to store the model
accessToken: Access token of the user.
modelName: The model name
revision: The friendly version
modelDescription: The model description
revisionDescription: The version description
exportConfiguration: Export configuration from the App features.
isSelectedOnly: If true, only the selected parts of the model would be exported
modelInfo: If provided, model is already existing in the cloud and it would be used for updating.
If not provided a new model would be created
permissions: If provided and it is model creation, permissions would be added after model creation
WARNING: Author would be excluded since they get automatically admin rights to the model.
profile: User's profile information. Currently, only organizationId is extracted from the dictionary.
author: Author information.
cancellationToken: Optional cancellation token to cancel the operation
progress: Optional. Progress reporter for upload progress.
Returns: A tuple (bool success, bool message) where message is the errorMessage in case of failure

Tekla.Structures.ModelInternal.ModelExporter.GetModelInfo
Creates and returns a Tekla.Structures.ModelInternal.dotCreateTrimBimFromModel_t object populated with default selection
settings.
Remarks: The returned object includes selection settings that specify which elements of the
model are included,  such as assembly parts, grids, and other components. These settings are preconfigured
to include all  assembly parts and grids, while excluding properties-only selections.
Returns: A Tekla.Structures.ModelInternal.dotCreateTrimBimFromModel_t object containing the default selection configuration.

Tekla.Structures.ModelInternal.ModelExporter.CopyResourceToTempFile(System.String,System.IO.Stream)
Copies an embedded resource from the assembly to a specified temporary file.
tempFileName: The full path of the temporary file to which the resource will be copied.  The directory specified in the
path must exist or be creatable.
resourceStream:  ExportConfiguration including the properties to be exported.
Throws System.IO.FileNotFoundException: Thrown if the embedded resource corresponding to tempFileName  cannot be found in the
assembly.

Tekla.Structures.ModelInternal.ModelExporter.GetOutputPath(System.String,System.String,System.String,System.String)
Constructs the output file path based on the specified folder path, model name, revision, and format.
folderPath: The directory in which the output file will be created. This must be a valid file system path.
modelName: The name of the model to include in the output file name. Cannot be null or empty.
revision: The revision identifier to include in the output file name. Cannot be null or empty.
format: The format of the output file. Must be one of the supported formats defined in Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.
Returns: The full path of the output file, including the directory, file name, and extension.
Throws System.ArgumentException: Thrown if format is not a recognized export type.

Tekla.Structures.ModelInternal.ModelExporter.ExportLocally(System.String,System.String,System.String,System.String[],System.IO.Stream,System.Boolean,System.Boolean)
Creates local export of the model in specified formats
folderPath: The folder location for the local exported files
modelName: Name of the model - used to generate the file name
revision: Revision - used to generate the file name
formats: Formats that the model is going to be exported to
exportConfiguration: Export configuration passed down from the higher level.
isSelectedOnly: Flag to indicate if full model or only selected parts are going to be included in the export action
overwrite: Optional flag to indicate if existing files should be overwritten. Default to false (do not overwrite)
Returns: True if export was successful, false otherwise

Tekla.Structures.ModelInternal.ModelExporter.GetCloudModelRequest(System.String,System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion,System.String,System.String,System.Collections.Generic.IReadOnlyDictionary{System.String,System.String},System.Collections.Generic.Dictionary{System.String,System.Object})
Builds the model Cloud request body
modelName: The model name
revision: The friendly version
region: The region to store the model
modelDescription: The model description
revisionDescription: The version description
profile: The user profile information. Currently, only organizationId is extracted from the dictionary.
author: The author information.
Returns: Returns the ModelRequest object for model upload